{
  "id": "vector-projection",
  "title": "Vector Projection",
  "subtitle": "An interactive exploration of projecting one vector onto another",
  "difficulty": 2,
  "readTime": "10 min",
  "tags": [
    "linear algebra",
    "vectors",
    "geometry"
  ],
  "state": {
    "vecAx": 3,
    "vecAy": 2,
    "vecBx": 4,
    "vecBy": 0
  },
  "content": {
    "type": "Fragment",
    "children": [
      {
        "type": "Section",
        "props": {
          "title": "1. Interactive Playground"
        },
        "children": [
          {
            "type": "p",
            "children": [
              "Drag the endpoints of the vectors, or edit the values directly below. The ",
              {
                "type": "strong",
                "props": {
                  "className": "text-green-600"
                },
                "children": "green vector"
              },
              " shows the projection of ",
              {
                "type": "strong",
                "props": {
                  "className": "text-red-600"
                },
                "children": "a"
              },
              " onto ",
              {
                "type": "strong",
                "props": {
                  "className": "text-blue-600"
                },
                "children": "b"
              },
              "."
            ]
          },
          {
            "type": "VectorProjectionViz",
            "props": {
              "bindAx": "vecAx",
              "bindAy": "vecAy",
              "bindBx": "vecBx",
              "bindBy": "vecBy"
            }
          }
        ]
      },
      {
        "type": "Section",
        "props": {
          "title": "2. What is Vector Projection?"
        },
        "children": [
          {
            "type": "Analogy",
            "children": "Imagine you're standing under a streetlight, and your shadow falls on the ground. The shadow is a projection of you onto the ground plane."
          },
          {
            "type": "p",
            "children": [
              "Vector projection works the same way: we're finding the \"shadow\" of one vector onto another. Specifically, we want to find the component of vector ",
              {
                "type": "strong",
                "children": "a"
              },
              " that lies along the direction of vector ",
              {
                "type": "strong",
                "children": "b"
              },
              "."
            ]
          },
          {
            "type": "Blockquote",
            "children": "The projection answers: \"How much of a points in the same direction as b?\""
          }
        ]
      },
      {
        "type": "Section",
        "props": {
          "title": "3. The Formula"
        },
        "children": [
          {
            "type": "p",
            "children": [
              "The projection of vector ",
              {
                "type": "strong",
                "children": "a"
              },
              " onto vector ",
              {
                "type": "strong",
                "children": "b"
              },
              " is:"
            ]
          },
          {
            "type": "Formula",
            "props": {
              "label": "Vector Projection Formula"
            },
            "children": "proj_b(a) = ((a · b) / |b|²) × b"
          },
          {
            "type": "p",
            "children": "Let's break this down:"
          },
          {
            "type": "Steps",
            "props": {
              "steps": [
                {
                  "title": "Dot Product (a · b)",
                  "description": "The dot product tells us how much the two vectors \"agree\" in direction. It's calculated as: a₁×b₁ + a₂×b₂"
                },
                {
                  "title": "Divide by |b|²",
                  "description": "We normalize by the squared length of b. This gives us a scalar that tells us how far along b the projection extends."
                },
                {
                  "title": "Multiply by b",
                  "description": "Finally, we multiply this scalar by vector b to get the actual projection vector pointing in the direction of b."
                }
              ]
            }
          },
          {
            "type": "DeepDive",
            "props": {
              "title": "❓ Q: Hey, if vector A were the same as vector B, wouldn't this just be the Pythagorean formula? a*a + b*b = c * c?",
              "defaultOpen": true,
              "id": "ann-1770323491375-elp55x"
            },
            "children": [
              {
                "type": "Callout",
                "props": {
                  "type": "info"
                },
                "children": [
                  {
                    "type": "em",
                    "children": "About \"a₁×b₁ + a₂×b₂\""
                  }
                ]
              },
              {
                "type": "p",
                "children": "You're absolutely right to notice that connection! When vector A equals vector B, the dot product A·A does become a₁² + a₂², which is indeed related to the Pythagorean theorem. This gives us the square of the vector's length (or magnitude)."
              },
              {
                "type": "p",
                "children": "However, there's a subtle but important difference from the traditional Pythagorean formula c² = a² + b². In the vector case, a₁ and a₂ are the components of a single vector - they're like the horizontal and vertical \"legs\" of that vector. So a₁² + a₂² equals the square of the vector's length, not the length itself."
              },
              {
                "type": "p",
                "children": "This is actually a key insight: the dot product of a vector with itself tells us how \"long\" that vector is (squared). But when we take the dot product of two different vectors, we're measuring something else entirely - how much they point in the same direction. The formula stays the same, but the geometric meaning changes completely depending on whether we're using the same vector twice or two different vectors."
              },
              {
                "type": "em",
                "props": {
                  "className": "text-gray-400 text-xs block mt-4"
                },
                "children": "(2/5/2026, 3:31:22 PM)"
              }
            ]
          },
          {
            "type": "DeepDive",
            "props": {
              "title": "❓ Q: If the vector is the hypotenuse, and the x and y components are the other sides, then show how this math works with two different vectors (ideally a diagram of two right triangles and the math of the dot product)",
              "defaultOpen": true,
              "id": "ann-1770324976608-zncdzr"
            },
            "children": [
              {
                "type": "Callout",
                "props": {
                  "type": "info"
                },
                "children": [
                  {
                    "type": "em",
                    "children": "About \"how much they point in the same direction\""
                  }
                ]
              },
              {
                "type": "p",
                "children": "Picture two vectors: vector A pointing at (3,4) and vector B pointing at (6,2). Each forms its own right triangle with the axes - A has legs of 3 and 4, while B has legs of 6 and 2."
              },
              {
                "type": "p",
                "children": "When we compute their dot product A·B = (3)(6) + (4)(2) = 18 + 8 = 26, we're not just multiplying corresponding components randomly. We're actually measuring how much of vector A's \"effort\" goes in the same direction as vector B. Think of it this way: if you project A onto B's direction, the dot product tells you the length of that projection multiplied by B's length."
              },
              {
                "type": "p",
                "children": "The key insight is that while each vector individually uses the Pythagorean theorem (A's length is √(3²+4²) = 5, B's length is √(6²+2²) = √40), the dot product captures something different entirely. It's measuring the geometric relationship between the two triangles - specifically, how aligned their hypotenuses are. If the vectors pointed in exactly the same direction, the dot product would equal the product of their lengths. If they were perpendicular, it would be zero, regardless of how long each hypotenuse is."
              },
              {
                "type": "em",
                "props": {
                  "className": "text-gray-400 text-xs block mt-4"
                },
                "children": "(2/5/2026, 3:56:05 PM)"
              }
            ]
          },
          {
            "type": "DeepDive",
            "props": {
              "title": "❓ Q: Why do we use multiplication here instead of addition?",
              "defaultOpen": true,
              "id": "ann-1770322860746-he1h4k"
            },
            "children": [
              {
                "type": "Callout",
                "props": {
                  "type": "info"
                },
                "children": [
                  {
                    "type": "em",
                    "children": "About \"dot product\""
                  }
                ]
              },
              {
                "type": "p",
                "children": "Multiplication captures how much two vectors \"agree\" in each direction, while addition would just combine their magnitudes without considering alignment."
              },
              {
                "type": "p",
                "children": "Think of it this way: if both vectors point strongly in the same direction (both components are positive and large), multiplying gives you a big positive number, showing strong agreement. If they point in opposite directions (one positive, one negative), multiplication gives you a negative number, showing disagreement. Addition would miss this directional relationship entirely."
              },
              {
                "type": "p",
                "children": "For example, if vector a = (3, 4) and vector b = (2, 1), the dot product is 3×2 + 4×1 = 10. Both vectors have positive components, so they generally point in the same direction. But if b = (-2, -1), you get 3×(-2) + 4×(-1) = -10, showing they point in opposite directions. If we used addition instead (3+2 + 4+1 = 10 vs 3+(-2) + 4+(-1) = 4), we'd lose this crucial directional information that tells us whether the vectors align or oppose each other."
              },
              {
                "type": "p",
                "children": "This directional agreement is exactly what we need for vector projection - we need to know how much one vector extends in the direction of another."
              },
              {
                "type": "em",
                "props": {
                  "className": "text-gray-400 text-xs block mt-4"
                },
                "children": "(2/5/2026, 3:20:52 PM)"
              }
            ]
          },
          {
            "type": "Footnote",
            "props": {
              "id": "ann-1770331337299-g1c2bu",
              "reference": "Multiplication captures how mu",
              "userNote": "Hey, this is like (naive) Fourier transforms! You look at each point of a signal and multiply it against the sin value of a particular frequency, and if there's a wave at that frequency in your signal, sin(wave) * signal(thatpoint) will always be positive!"
            },
            "children": [
              {
                "type": "Callout",
                "props": {
                  "type": "info",
                  "className": "mb-3 text-sm"
                },
                "children": [
                  {
                    "type": "strong",
                    "children": "📝 Your note: "
                  },
                  "Hey, this is like (naive) Fourier transforms! You look at each point of a signal and multiply it against the sin value of a particular frequency, and if there's a wave at that frequency in your signal, sin(wave) * signal(thatpoint) will always be positive!"
                ]
              },
              {
                "type": "p",
                "children": "Great observation! You've hit on a fundamental pattern that appears throughout mathematics and signal processing. In Fourier transforms, you're essentially measuring how much your signal \"agrees\" with a specific frequency by multiplying them pointwise - when they're in phase (both positive or both negative), you get positive contributions that accumulate, and when they're out of phase, you get cancellation."
              },
              {
                "type": "p",
                "children": "This same principle is exactly what's happening in vector dot products. When we multiply corresponding components of two vectors, we're checking their agreement in each dimensional direction. If both vectors point in the same direction along an axis, we get positive contribution. If they point in opposite directions, we get negative contribution (disagreement). The final dot product sums up all these directional agreements, giving us a single number that captures the overall alignment between the vectors."
              },
              {
                "type": "p",
                "children": "This is why the dot product is so central to vector projection - it's literally measuring how much one vector \"resonates\" with another, just like your Fourier example measures how much a signal resonates with a particular frequency. That's also why we can use the dot product to find the component of one vector that lies along another vector's direction, which is the essence of projection."
              },
              {
                "type": "em",
                "props": {
                  "className": "text-gray-400 text-xs block mt-2"
                },
                "children": "2/5/2026, 5:42:08 PM"
              }
            ]
          },
          {
            "type": "DeepDive",
            "props": {
              "title": "Deep Dive: This gives us a scalar",
              "defaultOpen": true,
              "id": "ann-1770322487239-276woq"
            },
            "children": [
              {
                "type": "p",
                "children": "When we divide the dot product by the squared length of vector b, we're converting a vector operation into a simple number. This scalar is crucial because it gives us the exact measurement of how much of vector a lies in the direction of vector b, expressed as a multiple of b's length."
              },
              {
                "type": "Example",
                "props": {
                  "title": "Example: From Vectors to Scalar"
                },
                "children": [
                  {
                    "type": "p",
                    "children": "Say we have vectors a = [6, 8] and b = [3, 0]. The dot product a·b = 18, and |b|² = 9."
                  },
                  {
                    "type": "Formula",
                    "props": {
                      "label": "Scalar calculation"
                    },
                    "children": "scalar = (a·b) / |b|² = 18 / 9 = 2"
                  },
                  {
                    "type": "p",
                    "children": "This scalar of 2 means the projection extends exactly 2 times the length of vector b in b's direction."
                  }
                ]
              },
              {
                "type": "Analogy",
                "children": "Think of it like measuring shadow length. If you shine a light perpendicular to a wall, your shadow has a certain length. The scalar tells you 'your shadow is 1.5 times as long as this reference stick' - it's a pure measurement, not a direction."
              },
              {
                "type": "DefinitionList",
                "props": {
                  "items": [
                    {
                      "term": "Before normalization",
                      "definition": "We have a·b, which mixes both the projection length AND the length of vector b"
                    },
                    {
                      "term": "After normalization",
                      "definition": "We get a pure scalar that isolates just the projection measurement"
                    },
                    {
                      "term": "The scalar's meaning",
                      "definition": "How many 'b-lengths' fit into the projection of a onto b"
                    }
                  ]
                }
              },
              {
                "type": "Callout",
                "props": {
                  "type": "tip"
                },
                "children": "Remember: this scalar will be positive if a and b point in similar directions, negative if they point in opposite directions, and zero if they're perpendicular. It's the coefficient that, when multiplied by the unit vector of b, gives you the actual projection vector."
              }
            ]
          },
          {
            "type": "Callout",
            "props": {
              "type": "info"
            },
            "children": [
              "With your current vectors: a = [",
              {
                "type": "StateValue",
                "props": {
                  "bind": "vecAx",
                  "format": ".1f"
                }
              },
              ", ",
              {
                "type": "StateValue",
                "props": {
                  "bind": "vecAy",
                  "format": ".1f"
                }
              },
              "] and b = [",
              {
                "type": "StateValue",
                "props": {
                  "bind": "vecBx",
                  "format": ".1f"
                }
              },
              ", ",
              {
                "type": "StateValue",
                "props": {
                  "bind": "vecBy",
                  "format": ".1f"
                }
              },
              "]"
            ]
          }
        ]
      },
      {
        "type": "Section",
        "props": {
          "title": "4. Alternative Form: Unit Vectors"
        },
        "children": [
          {
            "type": "p",
            "children": [
              "If we first normalize ",
              {
                "type": "strong",
                "children": "b"
              },
              " to a unit vector ",
              {
                "type": "strong",
                "children": "b̂"
              },
              " (length = 1), the formula simplifies:"
            ]
          },
          {
            "type": "Formula",
            "props": {
              "label": "Simplified Formula"
            },
            "children": "proj_b(a) = (a · b̂) × b̂"
          },
          {
            "type": "p",
            "children": "Here, (a · b̂) directly gives us the scalar projection — the signed length of the projection. Multiplying by b̂ converts it back to a vector."
          }
        ]
      },
      {
        "type": "Section",
        "props": {
          "title": "5. Why Does This Matter?"
        },
        "children": [
          {
            "type": "p",
            "children": "Vector projection appears everywhere in technical fields:"
          },
          {
            "type": "DefinitionList",
            "props": {
              "items": [
                {
                  "term": "🎮 Game Physics",
                  "definition": "When a ball bounces off a wall, we project its velocity onto the wall's normal to calculate the reflection."
                },
                {
                  "term": "📊 Machine Learning",
                  "definition": "PCA (Principal Component Analysis) projects high-dimensional data onto principal axes to reduce dimensionality."
                },
                {
                  "term": "🔧 Engineering",
                  "definition": "Breaking forces into components along and perpendicular to a surface is projection at work."
                },
                {
                  "term": "🖼️ Computer Graphics",
                  "definition": "Calculating lighting involves projecting the light direction onto surface normals for diffuse shading."
                }
              ]
            }
          }
        ]
      },
      {
        "type": "Section",
        "props": {
          "title": "6. Experiments to Try"
        },
        "children": [
          {
            "type": "p",
            "children": "Go back to the visualization above and try these experiments:"
          },
          {
            "type": "Steps",
            "props": {
              "steps": [
                "Make a and b perpendicular (90°). What happens to the projection?",
                "Make a point in the opposite direction of b. What do you notice about the projection?",
                "Make a parallel to b. How does the projection relate to a?",
                "Keep a fixed and change the length of b. Does the projection change?"
              ]
            }
          },
          {
            "type": "Callout",
            "props": {
              "type": "tip"
            },
            "children": "Hint: The projection's magnitude only depends on the angle between the vectors, not on the length of b!"
          }
        ]
      },
      {
        "type": "Section",
        "children": [
          {
            "type": "DeepDive",
            "props": {
              "title": "Deep Dive: This gives us a scalar that tells us how far along b the projection extends.",
              "defaultOpen": true
            },
            "children": [
              {
                "type": "p",
                "children": "This scalar is the heart of vector projection - it's the coordinate that tells us exactly where the projection lands on vector b. Without it, we'd just know the direction (which is b's direction), but not how far to travel along that direction to reach our projected point."
              },
              {
                "type": "Example",
                "props": {
                  "title": "Example: Walking Along a Path"
                },
                "children": [
                  {
                    "type": "p",
                    "children": "Say vector b = (3, 4) has length 5. After computing the dot product a·b = 15, we divide by |b|² = 25 to get scalar 0.6."
                  },
                  {
                    "type": "Formula",
                    "children": "scalar = (a·b) / |b|² = 15/25 = 0.6"
                  },
                  {
                    "type": "p",
                    "children": "This means: travel 0.6 times the full length of b to reach the projection. Since b has length 5, we travel 0.6 × 5 = 3 units along b's direction."
                  }
                ]
              },
              {
                "type": "Analogy",
                "children": "Think of it like GPS coordinates on a highway. Vector b is the highway, and this scalar is like saying 'your destination is at mile marker 0.6' - it tells you exactly how far along the highway to go, as a fraction of some reference distance."
              },
              {
                "type": "DefinitionList",
                "props": {
                  "items": [
                    {
                      "term": "Scalar < 1",
                      "definition": "Projection is shorter than b - we don't travel the full length"
                    },
                    {
                      "term": "Scalar = 1",
                      "definition": "Projection has exactly the same length as b"
                    },
                    {
                      "term": "Scalar > 1",
                      "definition": "Projection extends beyond b's endpoint"
                    },
                    {
                      "term": "Scalar = 0",
                      "definition": "Vectors are perpendicular - no projection along b"
                    }
                  ]
                }
              },
              {
                "type": "Callout",
                "props": {
                  "type": "tip"
                },
                "children": "To find the actual projection vector, multiply this scalar by the unit vector of b. The scalar tells you 'how much', and b's direction tells you 'which way' - together they give you the complete projection."
              }
            ]
          }
        ]
      }
    ]
  }
}